yuan_text = {}
yuan_text["ru"] = "[Тарифы](https://zgcvpn.ru/#tariffs)\n\n" \
                  "Реквизиты для оплаты:\n\n" \
                  "Alipay:\n" \
                  "https://zgc.su/pay/alipay.jpeg\n\n" \
                  "WeChat pay:\n" \
                  "https://zgc.su/pay/wechat.png\n\n" \
                  "*Пришлите пожалуйста скриншот оплаты*."

yuan_text["en"] = "[Rates](https://zgcvpn.ru/#tariffs)\n\n " \
                  " Payment details:\n\n" \
                  "Alipay:\n" \
                  "https://zgc.su/pay/alipay.jpeg\n\n" \
                  "WeChat pay:\n" \
                  "https://zgc.su/pay/wechat.png\n\n" \
                  "*Please send a screenshot of the payment*."

ru_site_yuan_text = """После оплаты ОБЯЗАТЕЛЬНО Пришлите скриншот где видно подключенный сервер успешного перевода! Реквизиты для оплаты по ссылкам ниже:"""

en_yuan_text = "[Rates](https://zgcvpn.ru/#tariffs)\n\n " \
               " Payment details:\n\n" \
               "Alipay:\n" \
               "https://zgc.su/pay/alipay.jpeg\n\n" \
               "WeChat pay:\n" \
               "https://zgc.su/pay/wechat.png\n\n" \
               "*Please send a screenshot of the payment*."

en_site_yuan_text = "After payment, BE SURE to send a screenshot of the successful transfer! Payment details for the " \
                    "links below:"

yuan_text_vk = "Тарифы: https://zgcvpn.ru/#tariffs\n\n" \
               "Реквизиты для оплаты:\n\n" \
               "Alipay:\n" \
               "https://zgc.su/pay/alipay.jpeg\n\n" \
               "WeChat pay:\n" \
               "https://zgc.su/pay/wechat.png\n\n" \
               "Пожалуйста, Пришлите скриншот где видно крупно сумму оплаты."

rub_text = {"ru": """Тарифы можно посмотреть тут https://zgcvpn.ru/#tariffs

❗️ Пожалуйста, НИЧЕГО НЕ УКАЗЫВАЙТЕ В КОММЕНТАРИЯХ к переводу.
Пришлите скриншот где видно крупно сумму оплаты или оплатите на сайте zgcvpn.ru/#tarrifs.

СБЕРБАНК:
5336690228278851

Тинькофф:
5536913846450605

Приват (гривны):
недоступно

Киви:
+79258852363

Яндекс деньги:
410013783404504""",

            "en": """Prices can be viewed here https://zgcvpn.ru/#tariffs

❗ ️ Please DO NOT SPECIFY ANYTHING IN THE COMMENTS to the comments.
Send a screenshot of the payment or pay on the website zgcvpn.ru/#tarrifs.

SBERBANK: 5336690228278851


Tinkoff: 5536913846450605


PayPal:
vpn@zgc.su
https://www.paypal.me/zgcvpn

Kiwi:
+79258852363

Yandex Money: 410013783404504"""}

ru_site_rub_text = """

Пожалуйста, НИЧЕГО НЕ УКАЗЫВАЙТЕ В КОММЕНТАРИЯХ к переводу. 
Пришлите скриншот где видно крупно сумму оплаты. СБЕРБАНК: 5336690228278851 
Тинькофф: 5536913846450605 Приват (гривны): недоступно 
Киви: +79258852363 Яндекс деньги: 410013783404504

"""

en_rub_text = """Prices can be viewed here https://zgcvpn.ru/#tariffs

❗ ️ Please DO NOT SPECIFY ANYTHING IN THE COMMENTS to the comments.
Send a screenshot of the payment or pay on the website zgcvpn.ru/#tarrifs.

SBERBANK: 5336690228278851


Tinkoff: 5536913846450605


PayPal:
vpn@zgc.su
https://www.paypal.me/zgcvpn

Kiwi:
+79258852363

Yandex Money: 410013783404504"""

en_site_rub_text = """
Please DO NOT SPECIFY ANYTHING IN THE COMMENTS to the translation.
Send a screenshot of the payment. SBERBANK: 5336690228278851
Tinkoff: 5536913846450605 PayPal: vpn@zgc.su
Kiwi: +79258852363 Yandex Money: 410013783404504
"""

rub_text_vk = """Тарифы можно посмотреть тут https://zgcvpn.ru/#tariffs

❗️ Пожалуйста, НИЧЕГО НЕ УКАЗЫВАЙТЕ В КОММЕНТАРИЯХ к переводу.
Пришлите скриншот где видно пкрупно сумму оплаты или оплатите на сайте zgcvpn.ru/#tarrifs.

СБЕРБАНК:
5336690228278851

Тинькофф:
5536913846450605

Приват (гривны):
недоступно
Киви:
+79258852363

Яндекс деньги:
410013783404504"""

trial_text = "Чтобы получить пробный период перейдите на [сайт](http://zgcvpn.ru) и укажите вашу почту.\n\n" \
             "Если во время настройки возникнут проблемы свяжитесь с нами!"

en_trial_text = "To get a trial period, go to (http://zgcvpn.ru) and send us your  e-mail. \n \n" \
                "If you have any problems during setup, please contact us!"

ru_site_trial_text = "Чтобы получить пробный период укажите вашу почту на сайте. Сделать это можно только один раз."

en_site_trial_text = "To get a free trial period, enter your email address on the site. This can only be done once."

trial_text_vk = "Чтобы получить пробный период перейдите на сайт http://zgcvpn.ru и укажите вашу почту.\n\n" \
                "Если во время настройки возникнут проблемы свяжитесь с нами!"

send_email = {}

send_email["ru"] = "Пожалуйста, пришлите адрес вашей электронной почты.\n\n" \
                   "Если вы являетесь нашим клиентом - обязательно пришлите адрес, на который регистрировали VPN!"
send_email["en"] = "Please send your email address.\n\n" \
                   "If you are our client - be sure to send the address to which you registered the VPN!"

buttons_menu = {}
buttons_menu["ru"] = "Выберите на клавиатуре снизу интересующий вас вопрос"
buttons_menu["en"] = "Select the question you are interested in on the keyboard below"

pay = """Спасибо за оплату!\n
🔥 Если ваша подписка не заработала – zgcvpn.ru/update\n 
🔥 Наши услуги лично для вас –  https://market.zgc.su/\n
🔥 АКЦИИ и ответы на вопросы –  https://market.zgc.su/vpnfaq\n
🔥 Наши публикации и новости о VPN –  https://market.zgc.su/zgcvpnblog\n

Пользуясь нашим сервисом, вы соглашаетесь с [правилами](https://zgcvpn.ru/rules).\n 
Приятного пользования!"""

pay_vk = """Спасибо за оплату!\n
🔥 Если ваша подписка не заработала – zgcvpn.ru/update\n 
🔥 Наши услуги лично для вас –  https://market.zgc.su/\n
🔥 АКЦИИ и ответы на вопросы –  https://market.zgc.su/vpnfaq\n
🔥 Наши публикации и новости о VPN –  https://market.zgc.su/zgcvpnblog\n

Пользуясь нашим сервисом, вы соглашаетесь с правилами https://zgcvpn.ru/rules.\n 
Приятного пользования!"""

pay_type = {}
pay_type["ru"] = "Оплата в рублях или в юанях?\n\n" \
                 "Если у вас возникнут другие вопросы по оплате - нажмите 'Связаться с поддержкой'"
pay_type["en"] = "Payment in rubles or yuan?\n\n" \
                 "If you have any other payment questions, click 'Contact Support'"

en_pay_type = "Payment in rubles or CNY? \n\n If you have any other questions about payment - click 'Contact support'"

close = "Чат завершен, спасибо за обращение!\n\n" \
        "Пожалуйста, оцените качество поддержки, чтобы мы могли стать лучше"

push_buttons = {}
push_buttons["ru"] = "\U0000274C Сообщение не доставлено\n" \
                     "Нажмите на кнопку с интересующей вас информацией\n\n" \
                     "Если у вас возникла проблема - нажмите 'Связаться с поддержкой'"

push_buttons["en"] = "\U0000274C Message not delivered\n" \
                     "Click on the button with the information you are interested in\n\n" \
                     "If you have a problem - click 'Contact Support'"
non_working = {}
non_working[
    "ru"] = f"Мы работаем по Пекину с 17:00 до 22:00 в рабочие дни и сейчас не можем ответить на ваши вопросы.\n\n" \
            f"Если у вас есть срочный вопрос - нажмите кнопку 'Срочная связь' и мы постараемся ответить как можно быстрее"
non_working[
    "en"] = f"We work in Beijing from 17:00 to 22:00 on weekdays and cannot answer your questions at this time.\n\n" \
            f"If you have an urgent question - click the 'Urgent Contact' button and we will try to answer as quickly as possible"

sheets_empty = "В гугл таблицах есть пропуск в одной из строк, колонки email, date, tg_id, vk_id, fb_id. " \
               "Все они должны быть заполнены, если ячейка пуста - пишем 0"

first_install = {}
first_install["ru"] = "Пожалуйста, подскажите:\n" \
                      "1. Пришлите скриншот где видно подключенный сервер выбранного сервера или проблемы\n" \
                      "2. Опишите проблему\n\n" \
                      "Этот способ связи предназначен только для новых клиентов."

first_install["en"] = "Please tell:\n" \
                      "1. Send a screenshot showing the connected server of the selected server or problems\n" \
                      "2. Describe the problem\n\n" \
                      "This contact method is for new customers only."

turk = {}
turk["ru"] = "Для перехода на сайт для жителей Туркменистана нажмите 'Сайт обслуживания'\n\n" \
             "Для получения информации по подключению нажмите 'Как подключить?'\n\n" \
             "Вы также можете нажать ОПЛАТА в главном меню и оплатить услугу"
turk["en"] = "To go to the website for residents of Turkmenistan, click on 'Service site' \n\n" \
             "To get information on connection, click on 'How to connect?'\n\n" \
             "In case of an urgent question, write to the email with the subject line \"TM\" vpn@zgc.su"

en_turk = "To go to the website for residents of Turkmenistan, click on 'Service site' \n\n" \
          "To get information on connection, click on 'How to connect?'\n\n" \
          "In case of an urgent question, write to the email with the subject line \"TM\" vpn@zgc.su"

coop = {}
coop["ru"] = "Вы можете описать свое предложение, перейдя по ссылке ниже"
coop["en"] = "You can describe your offer by clicking on the link below"
en_coop = "You can describe your offer by clicking on the link below"

shop = {}
shop["ru"] = "Узнайте все о наших продуктах"
shop["en"] = "Learn all about our products"
en_shop = "Learn all about our products"

support = {}
support["ru"] = "Для решения проблемы укажите:\n" \
                "1) Пришлите скриншот где видно подключенный сервер\n" \
                "2) Опишите проблему\n" \
                "3) После чего возникла проблема\n" \
                "Вы также можете попробовать найти решение проблемы в нашем [FAQ](zgcvpn.ru/faq)"

support["en"] = "To solve the problem, specify:\n" \
                "1) Send me screenshot with selected server\n" \
                "2) Describe the problem\n" \
                "You can also try to find a solution to the problem in our [FAQ] (market.zgc.su/vpnfaq)"

en_support = "To solve the problem, specify:\n" \
             "1) Send me screenshot with selected server\n" \
             "2) Describe the problem\n" \
             "You can also try to find a solution to the problem in our [FAQ] (market.zgc.su/vpnfaq)"

ru_site_support = """
Для решения проблемы укажите: 
1) Устройство 2) Выбранный сервер 
3) После чего возникла проблема 4) На каких сайтах или ресурсах 
5) Пришлите скриншот где видно подключенный сервер (снимок экрана, на котором видно проблему) 
Вы также можете попробовать найти решение проблемы в нашем FAQ:
"""

en_site_support = """
To solve the problem, specify:
1) Device 2) Selected Server
3) After which the problem occurred 4) On which sites or resources
5) Send a screenshot (a screenshot showing the problem).)
You can also try to find a solution to the problem in our FAQ:
"""

support_vk = "Для решения проблемы укажите:\n" \
             "1) Опишите проблему\n" \
             "5) Пришлите скриншот где видно подключенный сервер (снимок экрана, на котором видно выбранный сервер)\n\n" \
             "Вы также можете попробовать найти решение проблемы в нашем FAQ zgcvpn.ru/faq"

type_support = {}
type_support["ru"] = "Чат с поддержкой открыт\n\n" \
                     "Какой у вас вопрос? Первичная настройка (для недавно подключившихся клиентов) " \
                     "или что-то другое?\n\n"

type_support["en"] = "Support chat is open\n\n" \
                     "What problem needs help? Primary setup (for recently connected clients) " \
                     "or something else?\n\n"

en_type_support = "Support chat is open\n\n" \
                  "What problem needs help? Primary setup (for recently connected clients) " \
                  "or something else?\n\n"

get_better = {}
get_better["ru"] = "Пожалуйста, опишите одним сообщением, что нам стоит улучшить в работе сервиса?"
get_better["en"] = "Please describe in one message what we need to improve in the service?"
email_already_used = {}
email_already_used["ru"] = "Этот email уже называл ранее другой пользователь.\n" \
                           "Диалог с поддержкой открыт, подтвердите, что это ваша почта\n\n"
email_already_used["en"] = "This email has already been called by another user.\n" \
                           "Dialog with support is open, please confirm that this is your mail\n\n"

edit_wrong_mail = "Укажите в ответе неправильную почту, которую надо удалить"
edit_true_mail = "Укажите в ответе существующую в базе почту, в которую надо перенести айди клиента"
edit_confirm = "ID телеграма, вк и фб (если они не равны нулю) от неправильной почты будут перенесены в правильную, " \
               "а запись с неправильной почтой будет удалена из базы.\n\nПродолжить? Да/Нет ответом"

mailing_tariffs = "Перечислите через пробел тарифы для рассылки в ответе на это сообщение"
mailing_message = "Пришлите в ответе сообщение, которое хотите отправить выбранным тарифам"

left3days = "Здравствуйте! Это ваш VPN провайдер. Напоминаем вам, о том, что ваша подписка заканчивается через 3 дня. Будете продлевать?"
left1day = "Здравствуйте! Это ваш VPN провайдер. Напоминаем вам, о том, что ваша подписка заканчивается завтра. Будете продлевать?"
left_today = "Здравствуйте! Это ваш VPN провайдер. Напоминаем вам, о том, что ваша подписка заканчивается сегодня. Будете продлевать?"

info = "Команды:\n" \
       "/info: Информация, которую читаете сейчас\n" \
       "Ответы на сообщения клиентов:\n" \
       "пока, конец, off, /q : Закрыть диалог, клиент получит сообщение о завершении диалога и просьбу оценить сервис\n\n" \
       "/оплата, оп : Закрыть диалог, клиент получит сообщение с благодарностью и ссылку на инструкцию\n\n" \
       "/закрыть: Закрыть диалог, клиент не получит никакого сообщения\n" \
       "Регистр команд не важен\n\n" \
       "Ответ на сообщения, в которых есть айди клиента (внизу сообщения). " \
       "Также можно отвечать на сообщения, когда-то пересланные ботом из ТГ, но только если пользователь не скрыт.\n\n" \
       "Для телеграма доступны текст, фото, видео, файлы, голосовые, аудио, стикеры (как для клиента, так и для поддержки)\n\n" \
       "Для ВК: клиент может присылать текст, фото, голосовые. Поддержка может отвечать текстом, фото или файлом\n\n" \
       "Для ФБ: клиент может прислать текст или фото. Поддержка может отвечать только текстом\n\n" \
       "Обмен валют:" \
       "/wechange <телеграм ид> <новый номер вичат/алипей> - изменение номера вичат"

edit_by_mail_msg = """Укажите в ответе на это сообщение почту клиента и данные, которые надо изменить.
Сообщение должно в точности соответствовать следующему формату:

*почта клиента*;
*поле для редактирования*::*новое значение поля*;

Доступные поля для редактирования:
date - дата окончания подписки
tariff - номер оплаченного тарифа
sub - ссылка на подписку
tg_id - Телеграм айди клиента
vk_id - Вконтакте айди клиента
fb_id - Фейсбук айди клиента
Каждый айди - это число, присваиваемое аккаунту, а не придуманный пользователем никнейм

Пример ответного сообщения:
lol@kek.ru;
tg_id::12345678;
tariff::2;

Форма со всеми полями и пустыми данными:
почта_клиента;
date::;
tariff::;
sub::;
tg_id::;
vk_id::;
fb_id::;"""

edit_format_error = 'В формате сообщения ошибка'
